OpenFOAM/FE41/tutorials/transonicBump/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (234.636777 0 0);

boundaryField
{
    INLE1
    {
        type            pressureInletOutletVelocity;
        value           uniform (234.636777 0 0);
    }

    PRES2
    {
        type           pressureInletOutletVelocity;
        value          uniform (234.636777 0 0);
    }

    WALL3
    {
        type            slip; //fixedValue;
        value           uniform (0 0 0);
    }

    WALL4
    {
        type            slip; //fixedValue;
        value           uniform (0 0 0);
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
