OpenFOAM/FE41/tutorials/transonicBump/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

R R [0 2 -2 -1 0 0 0] 287.7;
Cp Cp [0 2 -2 -1 0 0 0] 1007;


// rho0            rho0 [ 1 -3 0 0 0 0 0 ] 1000;

// p0              p0 [ 1 -1 -2 0 0 0 0 ] 100000;

// psi             psi [ 0 -2 2 0 0 0 0 ] 4.54e-07;


// ************************************************************************* //
