OpenFOAM/FE41/tutorials/transonicBump/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
)

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.3;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

functions
(
    // flux
    // {
    //     type        divFlux;
    //     phiName     phi;

    //     functionObjectLibs ("libutilityFunctionObjects.so");
    // }

    // Mach
    // {
    //     type        MachNumber;
    //     UName       U;

    //     functionObjectLibs ("libutilityFunctionObjects.so");
    // }

    // minMaxU
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name U;
    // }

    // minMaxP
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name p;
    // }

    // minMaxRho
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name rho;
    // }

    // minMaxT
    // {
    //     type        minMaxField;

    //     // Where to load it from (if not already in solver)
    //     functionObjectLibs ("libfieldFunctionObjects.so");

    //     name T;
    // }
);


// ************************************************************************* //
