OpenFOAM/FE41/tutorials/transonicBump/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss MinmodDC;
    div(phid,p)     Gauss MinmodDC;
    div(phi,T)      Gauss MinmodDC;
    
    div(phi,e)      Gauss MinmodDC; //upwind;

    div((muEff*dev2(T(grad(U))))) Gauss linear;

    div((phi|interpolate(rho)),p) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
    // upwindRho vanLeer phi;
    // upwindPsi vanLeer phi;
    upwindRho Minmod phi;
    upwindPsi Minmod phi;
    
    // interpolate(rho) linear;
    // interpolate(rAU) linear;
    // interpolate(U) linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
